CSI API ETABS v1
cDetailing.StartDetailing Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int StartDetailing(
	bool OverwriteExisting
)
Function StartDetailing (
	OverwriteExisting As Boolean
) As Integer
Dim instance As cDetailing
Dim OverwriteExisting As Boolean
Dim returnValue As Integer
returnValue = instance.StartDetailing(OverwriteExisting)
int StartDetailing(
	bool OverwriteExisting
)
abstract StartDetailing :
        OverwriteExisting : bool -> int
Parameters
OverwriteExisting
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace